

#...........................................................................................
#.
#.
#.
#..................// this function import Thousand seprator  //............................
#.
#.
#.
#...........................................................................................


def num_sep(a):
    import locale
    locale.setlocale(locale.LC_ALL, '')  # Use '' for auto, or force e.g. to 'en_US.UTF-8'
    #............................// for iran server host //..............................
    # import locale
    # locale.setlocale(locale.LC_ALL, 'en_US')
    # 'en_US'
    # ............................// for iran server host //..............................
    value = a
    # نسخه پایین در هاست به مشکل خورد و مقداری با جدا کننده به ما نشان نمیداد
    # بدین منظور ما از مورد پایین تر استفاده کردیم

    value = f'{value:n}'  # For Python ≥3.6

    # ............................// for iran server host //..............................

    # value = locale.format_string("%d", value, grouping=True)

    # ............................// for iran server host //..............................

    return value


#...........................................................................................
#.
#.
#.
#..................// this function import Thousand seprator  //............................
#.
#.
#.
#...........................................................................................



